#+SETUPFILE: ~/.emacs.d/org-init/level-0.orgsetup
** EXPERIMENTAL Auto-Keys
   :PROPERTIES:
   :exports:  code
   :END:

   #+tblname: haskell-key-bindings
   | key     | fn                             |
   |---------+--------------------------------|
   | C-c l   | haskell-process-load-file      |
   | C-;     | insert-arrow                   |
   | C-:     | insert-rocket                  |
   | C-=     | insert-larrow                  |
   | C-,     | haskell-move-nested-left       |
   | C-.     | haskell-move-nested-right      |
   | C-c C-c | haskell-compile                |
   | C-h h   | hoogle                         |
   | C-c C-z | haskell-interactive-switch     |
   | C-c C-t | haskell-process-do-type        |
   | C-c C-i | haskell-process-do-info        |
   | C-c C-c | haskell-process-cabal-build    |
   | C-c C-l | haskell-process-load-or-reload |

   #+name: define keys from alist
   #+BEGIN_SRC emacs-lisp
     (defun toby/do-define-key (map-var key->fun)
       "Call define-key with the given map, key spec, and target function."
       (let ((keys (kbd (car key->fun)))
             (func (cadr key->fun)))
         (message "map: %s" map-var)
         (global-unset-key keys)
         (define-key map-var keys (intern func))))
   #+END_SRC

   #+name: define keys from table
   #+BEGIN_SRC emacs-lisp
     (defun toby/define-key-table (mode-map key-table-alist)
       "Defines key-mapptings in `mode-map' for all rows in the
     org-babel :var `key-table-alist'"
       (let ((key-fn (apply-partially #'toby/do-define-key mode-map)))
         (mapcar key-fn key-table-alist)))
   #+END_SRC

   #+RESULTS: define keys from table
   : toby/define-key-table

   #+tblname: test-key-bindings
   | C-c u | beginning-of-buffer |
   | C-c d | end-of-buffer       |

   #+name: usage-example
   #+header: :var keys=test-key-bindings
   #+header: :results list
   #+header: :tangle no
   #+BEGIN_SRC emacs-lisp
     (toby/define-key-table *tobys-mode-map* keys)
   #+END_SRC

   #+RESULTS: usage-example
   - insert-arrow

   #+name: haskell-example
   #+header: :var keys=test-key-bindings
   #+header: :results list
   #+header: :tangle no
   #+BEGIN_SRC emacs-lisp
     (toby/define-key-table haskell-mode-map keys)
   #+END_SRC

   #+RESULTS: haskell-example
   - beginning-of-buffer
   - end-of-buffer

